In [7]:
import pandas as pd
import sqlalchemy

In [8]:

engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/pandas')

In [14]:
df=pd.read_sql_table("customer",engine)
df

    id name  phonenumber
0  123  abc          234
1  345  def          456
2  567  efg          567

In [15]:
df=pd.read_sql_table("customer",engine,columns=['name','phonenumber'])
df

  name  phonenumber
0  abc          234
1  def          456
2  efg          567

In [19]:

query = '''
 SELECT customer.name, customer.phonenumber, orders.name, orders.amount
 FROM customer INNER JOIN orders
 ON customer.id=orders.coustmer_id
'''
df = pd.read_sql_query(query,engine)
df

  name  phonenumber name  amount
0  abc          234  abc     500
1  def          456  bcd      25

In [21]:
df=pd.read_csv('customer.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [22]:
df.rename(columns={
    'Customer Name':'name',
    'Customer Phone':'phonenumber'
},inplace=True)
df

              name  phonenumber
0     rafael nadal   4567895647
1  maria sharapova    434534545
2   vladimir putin     89345345
3      kim un jong    123434456
4       jeff bezos    934534543
5     rahul gandhi     44324222

In [24]:
df.to_sql(name='customer',con=engine,index=False,if_exists='append')

In [25]:
pd.read_sql("customer",engine)

    id             name  phonenumber
0  123              abc          234
1  345              def          456
2  567              efg          567
3    0     rafael nadal   2147483647
4    0  maria sharapova    434534545
5    0   vladimir putin     89345345
6    0      kim un jong    123434456
7    0       jeff bezos    934534543
8    0     rahul gandhi     44324222

In [26]:
pd.read_sql_query(query,engine)

  name  phonenumber name  amount
0  abc          234  abc     500
1  def          456  bcd      25